; domain
(define (domain logistics-domain)
 (:requirements :strips :typing :constraints :action-costs)
 (:types
    obj location city - object
    airport - location
    package truck airplane - obj
 )
 (:predicates (at_ ?obj - obj ?loc - location) (in ?obj1 - obj ?obj2 - obj) (incity ?obj_0 - location ?city - city))
 (:functions (total-cost))
 (:action loadtruck
  :parameters ( ?obj_1 - package ?truck - truck ?loc - location)
  :precondition (and (at_ ?truck ?loc) (at_ ?obj_1 ?loc))
  :effect (and (not (at_ ?obj_1 ?loc)) (in ?obj_1 ?truck) (increase (total-cost) 1)))
 (:action loadairplane
  :parameters ( ?obj_1 - package ?airplane - airplane ?loc - location)
  :precondition (and (at_ ?obj_1 ?loc) (at_ ?airplane ?loc))
  :effect (and (not (at_ ?obj_1 ?loc)) (in ?obj_1 ?airplane) (increase (total-cost) 1)))
 (:action unloadtruck
  :parameters ( ?obj - obj ?truck - truck ?loc - location)
  :precondition (and (at_ ?truck ?loc) (in ?obj ?truck))
  :effect (and (not (in ?obj ?truck)) (at_ ?obj ?loc) (increase (total-cost) 1)))
 (:action unloadairplane
  :parameters ( ?obj - obj ?airplane - airplane ?loc - location)
  :precondition (and (in ?obj ?airplane) (at_ ?airplane ?loc))
  :effect (and (not (in ?obj ?airplane)) (at_ ?obj ?loc) (increase (total-cost) 1)))
 (:action drivetruck
  :parameters ( ?truck - truck ?loc_from - location ?loc_to - location ?city - city)
  :precondition (and (at_ ?truck ?loc_from) (incity ?loc_from ?city) (incity ?loc_to ?city))
  :effect (and (not (at_ ?truck ?loc_from)) (at_ ?truck ?loc_to) (increase (total-cost) 1)))
 (:action flyairplane
  :parameters ( ?airplane - airplane ?loc_from_0 - airport ?loc_to_0 - airport)
  :precondition (and (at_ ?airplane ?loc_from_0))
  :effect (and (not (at_ ?airplane ?loc_from_0)) (at_ ?airplane ?loc_to_0) (increase (total-cost) 1)))
)

; problem
(define (problem logistics-problem)
 (:domain logistics-domain)
 (:objects
   l1_2 l1_3 l1_4 l1_5 l1_6 l1_7 l1_8 l1_9 l1_10 l2_2 l2_3 l2_4 l2_5 l2_6 l2_7 l2_8 l2_9 l2_10 - location
   c1 c2 - city
   p1 - package
   t1 t2 - truck
   a1 a2 - airplane
   l1_1 l2_1 - airport
 )
 (:init (incity l1_1 c1) (incity l1_2 c1) (incity l1_3 c1) (incity l1_4 c1) (incity l1_5 c1) (incity l1_6 c1) (incity l1_7 c1) (incity l1_8 c1) (incity l1_9 c1) (incity l1_10 c1) (incity l2_1 c2) (incity l2_2 c2) (incity l2_3 c2) (incity l2_4 c2) (incity l2_5 c2) (incity l2_6 c2) (incity l2_7 c2) (incity l2_8 c2) (incity l2_9 c2) (incity l2_10 c2) (at_ t1 l1_6) (at_ t2 l2_6) (at_ p1 l1_7) (at_ a1 l1_1) (at_ a2 l2_1) (= (total-cost) 0))
 (:goal (and (at_ p1 l2_1)))
 (:metric minimize (total-cost))
)

; plan
1. (drivetruck t1 l1_6 l1_7 c1)
   deleted: (at_ t1 l1_6)
   added: (at_ t1 l1_7)
   goals met: 0 of 1
2. (loadtruck p1 t1 l1_7)
   deleted: (at_ p1 l1_7)
   added: (in p1 t1)
   goals met: 0 of 1
3. (drivetruck t1 l1_7 l1_1 c1)
   deleted: (at_ t1 l1_7)
   added: (at_ t1 l1_1)
   goals met: 0 of 1
4. (unloadtruck p1 t1 l1_1)
   deleted: (in p1 t1)
   added: (at_ p1 l1_1)
   goals met: 0 of 1
5. (loadairplane p1 a1 l1_1)
   deleted: (at_ p1 l1_1)
   added: (in p1 a1)
   goals met: 0 of 1
6. (flyairplane a1 l1_1 l2_1)
   deleted: (at_ a1 l1_1)
   added: (at_ a1 l2_1)
   goals met: 0 of 1
7. (unloadairplane p1 a1 l2_1)
   deleted: (in p1 a1)
   added: (at_ p1 l2_1)
   goals met: 1 of 1
